[Zero_Madjack X2SoldierClassTemplate]

DisplayName="疯狂杰克"
ClassSummary="疯狂杰克是一名前锋，移动士兵，他带来了一些有用的技巧，专注于保护目标。"

LeftAbilityTreeTitle="近战"
RightAbilityTreeTitle="无私"
AbilityTreeTitles[0]="碎颅者"
AbilityTreeTitles[1]="劫持"
AbilityTreeTitles[2]="工具箱"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"


RandomNickNames[0]="狂战士"
RandomNickNames[1]="突击手"
RandomNickNames[2]="铁拳舞者"
RandomNickNames[3]="破规者" 
RandomNickNames[4]="救火队员"
RandomNickNames[5]="战地天使"
RandomNickNames[6]="废铁王者"
RandomNickNames[7]="碎心者"
RandomNickNames[8]="绝症医师"
RandomNickNames[9]="醉拳高手"
RandomNickNames[10]="战略撤退"
RandomNickNames[11]="机械战神"
RandomNickNames[12]="隐形杀手"
RandomNickNames[13]="沉默猎手"
RandomNickNames[14]="无敌零号"
RandomNickNames[15]="灵动战士"
RandomNickNames[16]="战殇"
RandomNickNames[17]="王牌战士"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="难以置信他还活着！"
PhotoboothSoloBLines_Male[1]="令人惊讶的是，他竟然从战斗中幸存下来。"
PhotoboothSoloBLines_Male[2]="他竟然成功了！"
PhotoboothSoloBLines_Male[3]="他完全不知道发生了什么！"
PhotoboothSoloBLines_Male[4]="他可能扎到了什么东西"
PhotoboothSoloBLines_Female[0]="她活了？酷。"
PhotoboothSoloBLines_Female[1]="请勿拍照。"
PhotoboothSoloBLines_Female[2]="远离太平间！"
PhotoboothSoloBLines_Female[3]="还没准备好去闯入呢！"
PhotoboothSoloBLines_Female[4]="火焰蛇，去你的！"

[Adrenalize X2AbilityTemplate]
LocFriendlyName="兴奋剂"
LocLongDescription="一剂危险的肾上腺素让士兵在他们的回合中可以执行一个额外的行动。"
LocHelpText="这个能力允许士兵在他们的回合中执行一个额外的行动。"
LocFlyOverText="可能会有后果。"
LocPromotionPopupText="<Bullet/> 在接下来的回合中，疯狂杰克将会行动迟缓，移动、命中和视野将受到惩罚。<br/>"

[MadJackHack X2AbilityTemplate]
LocFriendlyName="疯狂杰克破坏"
LocLongDescription="在你面前挥舞近战武器，释放疯狂杰克的混乱。"
LocHelpText="用你的武器进行一次巨大、毁灭性的横扫，伤害路径上的所有东西。"
LocFlyOverText="强化提升。"
LocPromotionPopupText="<Bullet/> 4回合冷却时间。<br/>"

[MadJackWireCutter X2AbilityTemplate]
LocFriendlyName="剪线器"
LocLongDescription="一次令人迷失的近战攻击，减少目标的黑客防御和意志，使机器人敌人陷入昏迷。"
LocHelpText="一次冒险的精准剑击，为后续攻击做好准备。"
LocFlyOverText="强化提升。"
LocPromotionPopupText="<Bullet/> 攻击时造成迷失，机械单位将瘫痪2个行动回合。<br/>"

[MadJackAbilitySet]
MadjackWireCutterEffectName="剪线器"
MadjackWireCutterEffectDesc="减少意志和黑客防御。"

[AdrenalineAdaptation X2AbilityTemplate]
LocFriendlyName="药物适应"
LocLongDescription="这名士兵已经适应了肾上腺素注射，不再承受后续的副作用。"
LocHelpText="兴奋剂不再施加惩罚。"

[MadjackeWarfare X2AbilityTemplate]
LocFriendlyName="电子战"
LocLongDescription="赋予混乱协议和特洛伊天赋。"
LocHelpText="混乱协议结合特洛伊天赋。"

[MadjackeWarfare2 X2AbilityTemplate]
LocFriendlyName="黑客升级"
LocLongDescription="赋予保险天赋，并提高士兵的黑客能力20。"
LocHelpText="保险天赋，黑客得分+20。"
LocPromotionPopupText="<Bullet/> +20 Hack.<br/>"

[Madjackpack X2AbilityTemplate]
LocFriendlyName="极限杰克"
LocLongDescription="赋予火箭推进能力，并为士兵配备一个重型武器槽位，以发挥最大破坏力。"
LocHelpText="准备重型火力，实现最大战场影响。"
LocPromotionPopupText="<Bullet/> 获得重型武器槽位和火箭推进能力。<br/>"
